{
    "Account & Security": "መለያ እና ደህንነት",
    "Add your email": "ኢሜልዎን ያስገቡ",
    "Bad Request. Please check your input.": "የተሳሳተ መረጃ፣ እባክዎ ያስገቡትን ያረጋግጡ",
    "By continuing you accept our": "በመቀጠል እኛን ትቀበላለህ",
    "Change Picture": "ምስል ቀይር",
    "Create your": "ይፍጠሩ",
    "Dark Mode": "ጥቁር ሁኔታ",
    "Email": "ኢሜል",
    "Error": "ስህተት",
    "Extracting barcode...": "ባርኮድ ማውጣት...",
    "Full Name": "ሙሉ ስም",
    "GetAI account": "GetAI መለያ",
    "GetAI is an AI-powered barcode scanner": "GetAI በአርቲፊሻል ኢንተሊጅንስ የተነቃቃ ባርኮድ ተመክሮ ነው",
    "Invalid barcode format.": "የተሳሳተ የባርኮድ ቅርጽ.",
    "Languages": "ቋንቋዎች",
    "Log in": "ግባ",
    "Network error. Please check your connection.": "የኔትወርክ ስህተት. እባክዎ አገናኝነትዎን ያረጋግጡ።",
    "Notifications": "ማሳወቂያዎች",
    "Password": "የይለፍ ቃል",
    "Phone Number": "ስልክ ቁጥር",
    "Product uploaded successfully!": "ምርት በተሳካ ሁኔታ ተጭኗል!",
    "Rate GetAI": "GetAIን እውቀት",
    "Save Changes": "ለውጦችን አስቀምጥ",
    "Scanned Products": "ያስገቡት ምርቶች",
    "Server Error": "የሰርቨር ስህተት",
    "Settings": "ቅንብሮች",
    "Share App": "መተግበሪያውን አጋራ",
    "Sign up": "ይመዝገቡ",
    "Read Less": "ጽሁፍ ያሳንሱ",
    "Read More": "ተጨማሪ ያንብቡ",
    "Find More Details in Chatbot": "በChatbot ተጨማሪ ዝርዝሮችን ያግኙ",
    "Terms and Conditions": "ውል እና መመሪያዎች",
    "Terms of Service": "የአገልግሎት ውል",
    "Too many requests. Please try again later.": "ብዙ ጥያቄዎች. እባክዎ ከጊዜ በኋላ ደግመው ይሞክሩ።",
    "Try another image": "ሌላ ምስል ይሞክሩ",
    "Unauthorized access. Please check your API key.": "ያልተፈቀደ ሙከራ. እባክዎ የAPI ቁልፉን ያረጋግጡ።",
    "We Couldn't Find Your Product": "ምርትዎን ማግኘት አልቻልንም",
    "We might not have your product yet, try searching by name.": "የጠየቁት ምርት ለጊዜው አልተገኘም, በስም ለመፈለግ ይሞክሩ።",
    "Enter name of product": "የምርት ስም ያስገቡ",
    "Upload Image": "ምስል ይጫኑ",
    "You can use your email to login to your account.": "ኢሜልዎን በመጠቀም ወደ አካውንትዎ መግባት ይችላሉ።",
    "Home": "ቤት",
    "Profile": "ፕሮፋይል",
    "Logout": "ከሂሳቦ ይውጡ",
    "Proceed to Chatbot": "ወደ Chatbot ቀጥል",
    "No Product History": "የምርት ታሪክ የለም",
    "Scan or upload to": "ስካን ወይም ለመጫን",
    "get started": "መጀመርያ",
    "Scan or upload an image of your products'": "የምርቶችዎን ስካን ወይም ምስል ይጫኑ",
    "to identify your product": "ምርትዎን ለመለየት",
    "Upload": "ምስል ይጫኑ",
    "Scan": "ስካን አድርግ",
    "Guest": "እንግዳ",
    "guest@gmail.com": "guest@gmail.com",
    "No access to camera": "ካሜራ መጠቀም አልተቻለም",
    "Product not found": "ምርት አልተገኘም",
    "Try Again": "ደግመው ይሞክሩ",
    "Place the barcode inside the frame": "ባርኮዱን በፍሬም ውስጥ ያስቀምጡ",
    "Capture Barcode": "ባርኮዱን ይቅረጹ",
    "Barcode detected! Retrieving product details...": "ባርኮድ ተገኝቷል! የምርት ዝርዝሮችን በመሰብሰብ ላይ...",
    "An error occurred. Please try again.": "ስህተት ተከስቷል. እባክዎ ደግመው ይሞክሩ።",
    "Product Upload": "ምርት መጫን",
    "discoveredProductPrefix": "እርሶ አግኝታችሁ",
    "discoveredProductSuffix": "! ምንኛ ተጠቃሚ ማወቅ ይፈልጋሉ, ጥቅሞች, ወይም አስተያየቶች?",
    "Sorry, something went wrong. Please try again later.": "ይቅርታ ተከስቷል እባክዎ ከጊዜ በኋላ ደግመው ይሞክሩ።",
    "What do you want to know?": "ምን ማወቅ ይፈልጋሉ?",
    "Feedback": "አስተያየት",
    "Rate Your Experience": "ተሞክሮዎን ይምረጡ",
    "Leave a comment": "አስተያየት ይተዉ",
    "Your message here": "መልእክትዎ እዚህ",
    "Send Feedback": "አስተያየት ይላኩ",
    "Duly Noted!": "በትክክል ተመዝግቧል!",
    "Thank you for your feedback! Your input helps us enhance our app to better meet your needs.": "ስለ አስተያየትዎ እናመሰግናለን! ያንተ እቅድ ፕሮግራማችንን እንደ እንድንማነት ያንሻልን ለማሻሻል።",
    "Go Home": "ወደ መነሻ ገጽ ተመለስ",
    "Feedback Submitted!": "አስተያየት ተላክቷል!",
    "Thank you for your feedback!": "ስለ አስተያየትዎ እናመሰግናለን!",
    "Error submitting feedback": "አስተያየት በመላክ ላይ ስህተት አጋጥሟል",
    "Failed to submit feedback. Please try again later.": "አስተያየት መላክ አልተቻለም። እባኮትን ከገና ይሞክሩ።",
    "Star": "ኮከብ",
    "Star-outline": "ኮከብ-ውጭ",
    "Close": "ዝጋ",
    "Main Menu": "ዋና ምናሌ",
    "Accounts": "መለያዎች",
    "Popular Today": "እንደማይረባ የዛሬ",
    "African Made": "እንግሊዝኛ አፍሪቃዊ",
    "Sponsored": "ተደግፈነበት",
    "Latest Additions": "እንግሊዝኛ እንደተጨማሪ ተጨማሪ",
    "Brand": "እንግሊዝኛ",
    "Shop Now": "አሁን ግብይት በማስቀመጥ",
    "Price": "ዋጋ",
    "Add to Cart": "ወደ ታክስ አክል",
    "What is this application for?": "ይህ መተግበሪያ ለምንድነው?",
    "Our app allows you to scan or upload a barcode to retrieve detailed information about a product. You can also proceed to our chatbot for further information and support in various languages including English, French, Swahili, Hausa, Amharic, Zulu, Twi, and Omoro.": "የእኛ መተግበሪያ ባር ኮድ እንዲቃኙ ወይም እንዲሰቅሉ ይፈቅድልዎታል።",
    "How do I use the barcode scanner?": "የባርኮድ ስካነርን እንዴት እጠቀማለሁ?",
    "To use the barcode scanner, simply tap on the Scan button, align the barcode within the viewfinder, and the app will automatically detect and retrieve the product details. Ensure your camera has sufficient lighting for accurate scanning.": "የባርኮድ ስካነርን ለመጠቀም በቀላሉ 'ስካን' የሚለውን ቁልፍ መታ ያድርጉ",
    "Can I upload a barcode image instead of scanning?": "ከመቃኘት ይልቅ የአሞሌ ኮድ ምስል መስቀል እችላለሁ?",
    "Yes, you can upload a barcode image by selecting the Upload option. Choose an image from your gallery that clearly shows the barcode. The app will process the image and provide product details similar to scanning.": "አዎ፣ 'ጫን' የሚለውን አማራጭ በመምረጥ የባርኮድ ምስል መስቀል ትችላለህ",
    "What languages does the app support?": "መተግበሪያው ምን ቋንቋዎችን ይደግፋል?",
    "Our app supports multiple languages, including English, French, Swahili, Hausa, Amharic, Zulu, Twi, and Omoro. You can select your preferred language from the settings to view product information and interact with the chatbot in that language.": "የእኛ መተግበሪያ እንግሊዝኛ፣ ፈረንሳይኛ፣ ስዋሂሊ፣ ሃውሳ፣ አማርኛ፣ ዙሉ፣ ትዊ እና ኦሞሮ ጨምሮ በርካታ ቋንቋዎችን ይደግፋል።",
    "How can I get more information about a product?": "ስለ አንድ ምርት ተጨማሪ መረጃ እንዴት ማግኘት እችላለሁ?",
    "After retrieving the product details, you have the option to chat with our chatbot for more in-depth information. The chatbot can assist you with additional product inquiries, availability, and other related questions.": "የምርት ዝርዝሮችን ሰርስረው ከወጡ በኋላ፣ ከቻትቦታችን ጋር የመወያየት አማራጭ አለዎት",
    "What should I do if the app does not recognize my barcode?": "መተግበሪያው የእኔን ባርኮድ ካላወቀ ምን ማድረግ አለብኝ?",
    "If the app does not recognize your barcode, please ensure the barcode is clear and well-lit. If you still encounter issues, try uploading a different image or contacting our support team for assistance.": "መተግበሪያው የእርስዎን የአሞሌ ኮድ ካላወቀ፣ እባክዎ ባርኮዱ ግልጽ እና በደንብ መብራቱን ያረጋግጡ",
    "How do I contact support?": "ድጋፍን እንዴት ማግኘት እችላለሁ?",
    "For any issues or support inquiries, you can contact us through the Help section in the app or email us directly at support@yourappdomain.com. We’re here to help you with any questions or problems you may have.": "ለማንኛውም ጉዳዮች ወይም የድጋፍ ጥያቄዎች፣ በ«እገዛ» ክፍል በኩል ሊያገኙን ይችላሉ።",
    "Is my data safe with this app?": "የእኔ ውሂብ በዚህ መተግበሪያ ደህንነቱ የተጠበቀ ነው?",
    "Yes, your data privacy and security are our top priorities. We use encryption and secure protocols to protect your information. For more details, please refer to our privacy policy available in the app.": "አዎ፣ የእርስዎ የውሂብ ግላዊነት እና ደህንነት ቅድሚያ የምንሰጣቸው ጉዳዮች ናቸው።",
    "1. Data Usage": "1. የውሂብ አጠቃቀም",
  "We collect and use data to provide accurate product details after scanning or uploading barcodes. Your personal data will be protected in accordance with our privacy policy.": "የአሞሌ ኮድ ከቃኘን ወይም ከሰቀልን በኋላ ትክክለኛ የምርት ዝርዝሮችን ለማቅረብ ውሂብ እንሰበስባለን እና እንጠቀማለን። የእርስዎ የግል መረጃ በእኛ የግላዊነት መመሪያ መሰረት ይጠበቃል",
  "2. Barcode Scanning": "2. ባርኮድ መቃኘት",
  "You are responsible for ensuring that you have the legal right to scan or upload any barcode. We provide information based on available product data, but we do not guarantee its accuracy or completeness.": "ማንኛውንም የአሞሌ ኮድ የመቃኘት ወይም የመስቀል ህጋዊ መብት እንዳለህ የማረጋገጥ ሃላፊነት አለብህ ባለው የምርት መረጃ ላይ ተመስርተን መረጃን እንሰጣለን ነገርግን ትክክለኛነት እና ሙሉነት ዋስትና አንሰጥም።",
  "3. Liability Disclaimer": "3. ተጠያቂነት ማስተባበያ",
  "We are not liable for any damages that arise from the use of incorrect or outdated product information. Please verify product details through our chatbot if necessary.": "የተሳሳተ ወይም ጊዜ ያለፈበት የምርት መረጃን በመጠቀም ለሚደርሱ ጉዳቶች ተጠያቂ አይደለንም። እባክዎ አስፈላጊ ከሆነ የምርት ዝርዝሮችን በቻትቦታችን በኩል ያረጋግጡ።",
  "4. Chatbot Assistance": "4. የቻትቦት እርዳታ",
  "The chatbot is provided to help you with additional product queries. The chatbot responses are for informational purposes only and do not constitute professional advice.": "ለተጨማሪ የምርት መጠይቆች እርስዎን ለማገዝ ቻትቦት ቀርቧል። የቻትቦት ምላሾች ለመረጃ አገልግሎት ብቻ እንጂ ሙያዊ ምክር አይደሉም።",
  "5. User Responsibilities": "5. የተጠቃሚ ኃላፊነቶች",
  "You must use the app in accordance with the law and refrain from submitting false or misleading data.": "መተግበሪያውን በህጉ መሰረት መጠቀም እና የውሸት ወይም አሳሳች ውሂብ ከማቅረብ መቆጠብ አለብዎት",
  "6. Changes to Terms": "6. ውሎች ላይ ለውጦች",
  "We reserve the right to modify these terms at any time. Please review them periodically to stay informed of updates": "እነዚህን ውሎች በማንኛውም ጊዜ የመቀየር መብታችን የተጠበቀ ነው። ስለ ዝመናዎች ለማወቅ እባክዎ በየጊዜው ይከልሷቸው።" ,
  "Welcome to our barcode scanning app. By using our services, you agree to comply with the following terms:" : "ወደ ባርኮድ መቃኛ መተግበሪያ እንኳን በደህና መጡ። አገልግሎቶቻችንን በመጠቀም፣ የሚከተሉትን ውሎች ለማክበር ተስማምተሃል፡"
}
