{
    "Account & Security": "Compte et sécurité",
    "Add your email": "Ajoutez votre email",
    "Bad Request. Please check your input.": "Mauvaise requête. Veuillez vérifier vos données.",
    "By continuing you accept our": "En continuant, vous acceptez nos",
    "Change Picture": "Changer la photo",
    "Create your": "Créez votre",
    "Dark Mode": "Mode sombre",
    "Email": "Email",
    "Error": "Erreur",
    "Extracting barcode...": "Extraction du code-barres...",
    "Full Name": "Nom complet",
    "GetAI account": "Compte GetAI",
    "GetAI is an AI-powered barcode scanner": "GetAI est un scanner de code-barres alimenté par l'IA",
    "Invalid barcode format.": "Format de code-barres invalide.",
    "Languages": "Langues",
    "Log in": "Connexion",
    "Network error. Please check your connection.": "Erreur de réseau. Veuillez vérifier votre connexion.",
    "Notifications": "Notifications",
    "Password": "Mot de passe",
    "Phone Number": "Numéro de téléphone",
    "Product uploaded successfully!": "Produit téléchargé avec succès !",
    "Rate GetAI": "Évaluer GetAI",
    "Save Changes": "Sauvegarder les modifications",
    "Scanned Products": "Produits scannés",
    "Server Error": "Erreur du serveur",
    "Settings": "Paramètres",
    "Share App": "Partager l'appli",
    "Sign up": "Inscription",
    "Read Less": "Lire moins",
    "Read More": "Lire plus",
    "Find More Details in Chatbot": "Trouver plus de détails dans le chatbot",
    "Terms and Conditions": "Conditions d'utilisation",
    "Terms of Service": "Conditions de service",
    "Too many requests. Please try again later.": "Trop de requêtes. Veuillez réessayer plus tard.",
    "Try another image": "Essayer une autre image",
    "Unauthorized access. Please check your API key.": "Accès non autorisé. Veuillez vérifier votre clé API.",
    "Upload Image": "Télécharger une image",
    "You can use your email to login to your account.": "Vous pouvez utiliser votre email pour vous connecter à votre compte.",
    "We Couldn't Find Your Product": "Nous n'avons pas trouvé votre produit",
    "We might not have your product yet, try searching by name.": "Nous n'avons peut-être pas encore votre produit, essayez de rechercher par nom.",
    "Enter name of product": "Entrez le nom du produit",
    "Home": "Accueil",
    "Profile": "Profil",
    "Logout": "Déconnexion",
    "Proceed to Chatbot": "Aller au Chatbot",
    "No Product History": "Aucun historique de produit",
    "Scan or upload to": "Scanner ou télécharger pour",
    "get started": "Commencer",
    "Scan or upload an image of your products'": "Scanner ou télécharger une image de vos produits",
    "to identify your product": "pour identifier votre produit",
    "Upload": "Télécharger",
    "Scan": "Scanner",
    "Guest": "Invité",
    "guest@example.com": "invité@example.com",
    "No access to camera": "Pas d'accès à la caméra",
    "Product not found": "Produit non trouvé",
    "Try Again": "Réessayer",
    "Place the barcode inside the frame": "Placez le code à barres dans le cadre",
    "Capture Barcode": "Capturer le code à barres",
    "Product Upload": "Téléchargement de produit",
    "Barcode detected! Retrieving product details...": "Code à barres détecté ! Récupération des détails du produit...",
    "discoveredProductPrefix": "Vous avez découvert",
    "discoveredProductSuffix": "! Voulez-vous en savoir plus sur son utilisation, ses avantages ou ses avis?",
    "Sorry, something went wrong. Please try again later.": "Désolé, quelque chose s'est mal passé. Veuillez réessayer plus tard.",
    "What do you want to know?": "Que voulez-vous savoir ?",
    "Feedback": "Retour d'information",
    "Rate Your Experience": "Évaluez votre expérience",
    "Leave a comment": "Laissez un commentaire",
    "Your message here": "Votre message ici",
    "Send Feedback": "Envoyer le retour d'information",
    "Duly Noted!": "Bien noté !",
    "Thank you for your feedback! Your input helps us enhance our app to better meet your needs.": "Merci pour votre retour d'information ! Votre avis nous aide à améliorer notre application pour mieux répondre à vos besoins.",
    "Go Home": "Retour à l'accueil",
    "Feedback Submitted!": "Retour d'information envoyé !",
    "Thank you for your feedback!": "Merci pour votre retour d'information !",
    "Error submitting feedback": "Erreur lors de l'envoi du retour d'information",
    "Failed to submit feedback. Please try again later.": "Échec de l'envoi du retour d'information. Veuillez réessayer plus tard.",
    "Star": "Étoile",
    "Star-outline": "Étoile-outline",
    "Close": "Fermer",
    "Accounts": "Comptes",
    "Popular Today": "Populaire Aujourd'hui",
    "African Made": "Fabriqué en Afrique",
    "Sponsored": "Sponsorisé",
    "Latest Additions": "Dernières Ajouts",
    "Brand": "Marque",
    "Shop Now": "Acheter Maintenant",
    "Price": "Prix",
    "Add to Cart": "Ajouter au Panier",
    "What is this application for?": "A quoi sert cette application ?",
    "Our app allows you to scan or upload a barcode to retrieve detailed information about a product. You can also proceed to our chatbot for further information and support in various languages including English, French, Swahili, Hausa, Amharic, Zulu, Twi, and Omoro.": "Notre application vous permet de scanner ou de télécharger un code-barres",
    "How do I use the barcode scanner?": "Comment utiliser le lecteur de codes-barres ?",
    "To use the barcode scanner, simply tap on the Scan button, align the barcode within the viewfinder, and the app will automatically detect and retrieve the product details. Ensure your camera has sufficient lighting for accurate scanning.": "Pour utiliser le lecteur de codes-barres, appuyez simplement sur le bouton ",
    "Can I upload a barcode image instead of scanning?": "Puis-je télécharger une image de code-barres au lieu de la scanner ?",
    "Yes, you can upload a barcode image by selecting the Upload option. Choose an image from your gallery that clearly shows the barcode. The app will process the image and provide product details similar to scanning.": "Oui, vous pouvez télécharger une image de code-barres en sélectionnant l'option",
    "What languages does the app support?": "Quelles langues l'application prend-elle en charge ?",
    "Our app supports multiple languages, including English, French, Swahili, Hausa, Amharic, Zulu, Twi, and Omoro. You can select your preferred language from the settings to view product information and interact with the chatbot in that language.": "Notre application prend en charge plusieurs langues, dont l'anglais, le français, le swahili, le haoussa, l'amharique, le zoulou, le twi et l'omoro",
    "How can I get more information about a product?": "Comment puis-je obtenir plus d’informations sur un produit ?",
    "After retrieving the product details, you have the option to chat with our chatbot for more in-depth information. The chatbot can assist you with additional product inquiries, availability, and other related questions.": "Après avoir récupéré les détails du produit, vous avez la possibilité de discuter avec notre chatbot",
    "What should I do if the app does not recognize my barcode?": "Que dois-je faire si l’application ne reconnaît pas mon code-barres ?",
    "If the app does not recognize your barcode, please ensure the barcode is clear and well-lit. If you still encounter issues, try uploading a different image or contacting our support team for assistance.": "Si l'application ne reconnaît pas votre code-barres, assurez-vous que celui-ci est clair et bien éclairé.",
    "How do I contact support?": "Comment contacter l'assistance ?",
    "For any issues or support inquiries, you can contact us through the Help section in the app or email us directly at GETAiAfrica@gmail.com. We’re here to help you with any questions or problems you may have.": "Pour tout problème ou demande d'assistance, vous pouvez nous contacter via la section",
    "Is my data safe with this app?": "Mes données sont-elles en sécurité avec cette application ?",
    "Yes, your data privacy and security are our top priorities. We use encryption and secure protocols to protect your information. For more details, please refer to our privacy policy available in the app.": "Oui, la confidentialité et la sécurité de vos données sont nos principales priorités",
    "1. Data Usage": "1. Utilisation des données",
  "We collect and use data to provide accurate product details after scanning or uploading barcodes. Your personal data will be protected in accordance with our privacy policy.": "Nous collectons et utilisons des données pour fournir des détails précis sur les produits après avoir scanné ou téléchargé des codes-barres. Vos données personnelles seront protégées conformément à notre politique de confidentialité.",
  "2. Barcode Scanning": "2. Lecture de codes-barres",
  "You are responsible for ensuring that you have the legal right to scan or upload any barcode. We provide information based on available product data, but we do not guarantee its accuracy or completeness.": "Vous êtes responsable de vous assurer que vous avez le droit légal de scanner ou de télécharger n'importe quel code-barres. Nous fournissons des informations basées sur les données disponibles sur les produits, mais nous ne garantissons pas leur exactitude ou leur exhaustivité.",
  "3. Liability Disclaimer": "3. Clause de non-responsabilité",
  "We are not liable for any damages that arise from the use of incorrect or outdated product information. Please verify product details through our chatbot if necessary.": "Nous ne sommes pas responsables des dommages résultant de l'utilisation d'informations incorrectes ou obsolètes sur le produit. Veuillez vérifier les détails du produit via notre chatbot si nécessaire",
  "4. Chatbot Assistance": "4. Assistance chatbot",
  "The chatbot is provided to help you with additional product queries. The chatbot responses are for informational purposes only and do not constitute professional advice.": "Le chatbot est fourni pour vous aider avec des requêtes de produits supplémentaires. Les réponses du chatbot sont uniquement à titre informatif et ne constituent pas un conseil professionnel.",
  "5. User Responsibilities": "5. Responsabilités de l'utilisateur",
  "You must use the app in accordance with the law and refrain from submitting false or misleading data": "Vous devez utiliser l'application conformément à la loi et vous abstenir de soumettre des données fausses ou trompeuses.",
  "6. Changes to Terms": "6. Modifications des conditions",
  "We reserve the right to modify these terms at any time. Please review them periodically to stay informed of updates": "Nous nous réservons le droit de modifier ces conditions à tout moment. Veuillez les consulter périodiquement pour rester informé des mises à jour.",
  "Welcome to our barcode scanning app. By using our services, you agree to comply with the following terms:": "Bienvenue sur notre application de numérisation de codes-barres. En utilisant nos services, vous acceptez de respecter les conditions suivantes :"
 }