{
    "Account & Security": "Asusu & Tsaro",
    "Add your email": "Ƙara imel ɗinku",
    "Bad Request. Please check your input.": "Buƙatu mara kyau. Da fatan za a duba shigarwarku.",
    "By continuing you accept our": "Ta hanyar ci gaba kuna karɓar mu",
    "Change Picture": "Canza Hoto",
    "Create your": "Ƙirƙiri naka",
    "Dark Mode": "Yanayin Duhu",
    "Email": "Imel",
    "Error": "Kuskure",
    "Extracting barcode...": "Ana cire barcode...",
    "Full Name": "Cikakken Suna",
    "GetAI account": "Asusun GetAI",
    "GetAI is an AI-powered barcode scanner": "GetAI na’ura ce mai amfani da AI don duba barcode",
    "Invalid barcode format.": "Tsarin barcode mara kyau.",
    "Languages": "Harsuna",
    "Log in": "Shiga",
    "Network error. Please check your connection.": "Kuskuren hanyar sadarwa. Da fatan za a duba haɗin ku.",
    "Notifications": "Sanarwa",
    "Password": "Kalmar sirri",
    "Phone Number": "Lambar Waya",
    "Product uploaded successfully!": "An ɗora samfurin cikin nasara!",
    "Rate GetAI": "Kimanta GetAI",
    "Save Changes": "Ajiye Sauye-sauye",
    "Scanned Products": "Kayayyakin da aka duba",
    "Server Error": "Kuskuren Uwar Garke",
    "Settings": "Saituna",
    "Share App": "Raba Manhaja",
    "Sign up": "Yi rajista",
    "Read Less": "Karanta Kaɗan",
    "Read More": "Karanta Ƙari",
    "Find More Details in Chatbot": "Nemo Cikakken Bayani a cikin Chatbot",
    "Terms and Conditions": "Sharuɗɗa da Ka’idoji",
    "Terms of Service": "Sharuɗɗan Sabis",
    "Too many requests. Please try again later.": "Buƙatu da yawa. Da fatan za a sake gwadawa daga baya.",
    "Try another image": "Gwada wani hoto",
    "Unauthorized access. Please check your API key.": "Babu izinin shiga. Da fatan za a duba mabuɗin API ɗinku.",
    "We Couldn't Find Your Product": "Ba mu iya samun samfurinku ba",
    "We might not have your product yet, try searching by name.": "Wataƙila ba mu da samfurin ku tukuna, gwada neman ta sunan.",
    "Enter name of product": "Shigar da sunan samfur",
    "Upload Image": "Loda Hoto",
    "You can use your email to login to your account.": "Kuna iya amfani da imel ɗinku don shiga cikin asusunku.",
    "Home": "Gida",
    "Profile": "Bayani",
    "Logout": "Fita",
    "Proceed to Chatbot": "Ci gaba zuwa Chatbot",
    "No Product History": "Babu Tarihin Samfura",
    "Scan or upload to": "Duba ko loda zuwa",
    "get started": "fara",
    "Scan or upload an image of your products'": "Duba ko loda hoton samfuran ku'",
    "to identify your product": "don gano samfurinku",
    "Upload": "Loda",
    "Scan": "Duba",
    "Guest": "Baƙo",
    "guest@gmail.com": "bako@gmail.com",
    "No access to camera": "Babu izinin shiga kyamara",
    "Product not found": "Ba a sami samfurin ba",
    "Try Again": "Sake Gwada",
    "Place the barcode inside the frame": "Sanya barcode a cikin firam",
    "Capture Barcode": "Kamawa Barcode",
    "Barcode detected! Retrieving product details...": "An gano barcode! Ana dawo da bayanan samfur...",
    "An error occurred. Please try again.": "An sami kuskure. Da fatan za a sake gwadawa.",
    "Product Upload": "Loda Samfuri",
    "discoveredProductPrefix": "Kun gano",
    "discoveredProductSuffix": "! Kuna so ku san ƙarin game da amfani, fa'idodi, ko bita?",
    "Sorry, something went wrong. Please try again later.": "Yi haƙuri, wani abu ya tafi ba daidai ba. Da fatan za a sake gwadawa daga baya.",
    "What do you want to know?": "Me kuke so ku sani?",
    "Feedback": "Ra'ayi",
    "Rate Your Experience": "Kimanta Kwarewarka",
    "Leave a comment": "Bar ra'ayi",
    "Your message here": "Saƙonka nan",
    "Send Feedback": "Tura Ra'ayi",
    "Duly Noted!": "An lura da kyau!",
    "Thank you for your feedback! Your input helps us enhance our app to better meet your needs.": "Na gode da ra'ayinka! Shigarwarka yana taimaka mana wajen inganta manhajarmu domin ta fi dacewa da bukatunku.",
    "Go Home": "Koma Gida",
    "Feedback Submitted!": "Ra'ayi ya tura!",
    "Thank you for your feedback!": "Na gode da ra'ayinka!",
    "Error submitting feedback": "Kuskure wajen tura ra'ayi",
    "Failed to submit feedback. Please try again later.": "An kasa tura ra'ayi. Da fatan za a sake gwadawa daga baya.",
    "Star": "Tauraro",
    "Star-outline": "Tauraro-outline",
    "Close": "Rufe",
    "Accounts": "Asusu",
    "Popular Today": "Mashahurin Yau",
    "African Made": "Na Afirka",
    "Sponsored": "Taimakon Kuɗi",
    "Latest Additions": "Ƙarin Sabbin Kaya",
    "Brand": "Suna",
    "Shop Now": "Saya Yanzu",
    "Price": "Farashi",
    "Add to Cart": "Ƙara zuwa Jaka",
    "What is this application for?": "Menene wannan aikace-aikacen?",
    "Our app allows you to scan or upload a barcode to retrieve detailed information about a product. You can also proceed to our chatbot for further information and support in various languages including English, French, Swahili, Hausa, Amharic, Zulu, Twi, and Omoro.": "App ɗin mu yana ba ku damar bincika ko loda lambar lambar sirri",
    "How do I use the barcode scanner?": "Ta yaya zan yi amfani da na'urar daukar hotan takardu?",
    "To use the barcode scanner, simply tap on the Scan button, align the barcode within the viewfinder, and the app will automatically detect and retrieve the product details. Ensure your camera has sufficient lighting for accurate scanning.": "Don amfani da na'urar daukar hotan takardu, kawai danna maɓallin 'Scan'",
    "Can I upload a barcode image instead of scanning?": "Zan iya loda hoton barcode maimakon dubawa?",
    "Yes, you can upload a barcode image by selecting the Upload option. Choose an image from your gallery that clearly shows the barcode. The app will process the image and provide product details similar to scanning.": "Eh, za ka iya upload wani barcode image ta zabi da 'Upload' zaɓi",
    "What languages does the app support?": "Wadanne harsuna app ke tallafawa?",
    "Our app supports multiple languages, including English, French, Swahili, Hausa, Amharic, Zulu, Twi, and Omoro. You can select your preferred language from the settings to view product information and interact with the chatbot in that language.": "App ɗin mu yana tallafawa yaruka da yawa, gami da Ingilishi, Faransanci, Swahili, Hausa, Amharic, Zulu, Twi, da Omoro",
    "How can I get more information about a product?": "Ta yaya zan iya samun ƙarin bayani game da samfur?",
    "After retrieving the product details, you have the option to chat with our chatbot for more in-depth information. The chatbot can assist you with additional product inquiries, availability, and other related questions.": "Bayan dawo da bayanan samfurin, kuna da zaɓi don yin taɗi tare da bot ɗin mu",
    "What should I do if the app does not recognize my barcode?": "Me zan yi idan app din bai gane lambar lamba ta ba?",
    "If the app does not recognize your barcode, please ensure the barcode is clear and well-lit. If you still encounter issues, try uploading a different image or contacting our support team for assistance.": "Idan app ɗin bai gane lambar lambar ku ba, da fatan za a tabbatar da barcode a sarari kuma yana haskakawa",
    "How do I contact support?": "Ta yaya zan tuntuɓar tallafi?",
    "For any issues or support inquiries, you can contact us through the Help section in the app or email us directly at GETAiAfrica@gmail.com. We’re here to help you with any questions or problems you may have.": "Don kowace matsala ko tambayoyin goyan baya, zaku iya tuntuɓar mu ta sashin 'Taimako'",
    "Is my data safe with this app?": "Shin bayanana suna lafiya tare da wannan app?",
    "Yes, your data privacy and security are our top priorities. We use encryption and secure protocols to protect your information. For more details, please refer to our privacy policy available in the app.": "Ee, keɓanta bayananku da tsaro sune manyan abubuwan da muka fi ba da fifiko",
    "1. Data Usage": "1. Amfanin Data",
  "We collect and use data to provide accurate product details after scanning or uploading barcodes. Your personal data will be protected in accordance with our privacy policy.": "Muna tattarawa da amfani da bayanai don samar da ingantattun bayanan samfur bayan dubawa ko loda lambobin sirri. Za a kiyaye bayanan keɓaɓɓen ku bisa ga manufar keɓantawar mu.",
  "2. Barcode Scanning": "2. Barcode Scanning",
  "You are responsible for ensuring that you have the legal right to scan or upload any barcode. We provide information based on available product data, but we do not guarantee its accuracy or completeness.": "Kai ne ke da alhakin tabbatar da cewa kana da haƙƙin doka don bincika ko loda kowace lambar lamba. Muna ba da bayanai bisa samammun bayanan samfur, amma ba mu da garantin daidaito ko cikar sa",
  "3. Liability Disclaimer": "3. Laifin Laifi",
  "We are not liable for any damages that arise from the use of incorrect or outdated product information. Please verify product details through our chatbot if necessary.": "Ba mu da alhakin duk wani lahani da ya taso daga amfani da bayanan samfur mara daidai ko tsufa. Da fatan za a tabbatar da bayanan samfur ta hanyar chatbot ɗin mu idan ya cancanta.",
  "4. Chatbot Assistance": "4. Taimakon Chatbot",
  "The chatbot is provided to help you with additional product queries. The chatbot responses are for informational purposes only and do not constitute professional advice.": "An samar da chatbot don taimaka muku da ƙarin tambayoyin samfur. Amsoshin chatbot don dalilai ne na bayanai kawai kuma ba su zama shawara na ƙwararru ba",
  "5. User Responsibilities": "5. Matsayin Mai amfani",
  "You must use the app in accordance with the law and refrain from submitting false or misleading data": "Dole ne ku yi amfani da app ɗin daidai da doka kuma ku guji ƙaddamar da bayanan karya ko yaudara",
  "6. Changes to Terms": "6. Canje-canje ga Sharuɗɗan",
  "We reserve the right to modify these terms at any time. Please review them periodically to stay informed of updates": "Muna tanadin haƙƙin canza waɗannan sharuɗɗan a kowane lokaci. Da fatan za a yi bitar su lokaci-lokaci don kasancewa da masaniyar sabbin abubuwa",
  "Welcome to our barcode scanning app. By using our services, you agree to comply with the following terms:" : "Barka da zuwa ga barcode scanning app. Ta amfani da ayyukanmu, kun yarda ku bi waɗannan sharuɗɗan:" ,
  "Looking for your product...": "Neman samfurin ku...",
  "Almost there! Sit back while we fetch the details...": "Kusan akwai! Zauna muje mu debo cikakkun bayanai...",
  "Just a moment, we’re getting the information you need..." : "A ɗan lokaci kaɗan, muna samun bayanin da kuke buƙata...",
  "Hang tight, we’re locating your product details...": "Tsaya sosai, muna gano bayanan samfuran ku...",
  "Scanned": "An duba"
}
