{
    "Account & Security": "Akaunti na Usalama",
    "Add your email": "Ongeza barua pepe yako",
    "Bad Request. Please check your input.": "Ombi Mbaya. Tafadhali angalia kipengele chako.",
    "By continuing you accept our": "Kwa kuendelea unakubali yetu",
    "Change Picture": "Badilisha Picha",
    "Create your": "Unda yako",
    "Dark Mode": "Hali ya Giza",
    "Email": "Barua pepe",
    "Error": "Hitilafu",
    "Extracting barcode...": "Inatoa msimbo wa pau...",
    "Full Name": "Jina Kamili",
    "GetAI account": "Akaunti ya GetAI",
    "GetAI is an AI-powered barcode scanner": "GetAI ni skana ya msimbo wa pau inayotumia AI",
    "Invalid barcode format.": "Umbizo la msimbo wa pau si sahihi.",
    "Languages": "Lugha",
    "Log in": "Ingia",
    "Network error. Please check your connection.": "Hitilafu ya mtandao. Tafadhali angalia muunganisho wako.",
    "Notifications": "Arifa",
    "Password": "Nenosiri",
    "Phone Number": "Nambari ya Simu",
    "Product uploaded successfully!": "Bidhaa imepakiwa kwa mafanikio!",
    "Rate GetAI": "Pima GetAI",
    "Read Less": "Soma Chini",
    "Read More": "Soma Zaidi",
    "Find More Details in Chatbot": "Pata maelezo zaidi kwenye chatbot",
    "Save Changes": "Hifadhi Mabadiliko",
    "Scanned Products": "Bidhaa Zilizokaguliwa",
    "Server Error": "Hitilafu ya Seva",
    "Settings": "Mipangilio",
    "Share App": "Shiriki Programu",
    "Sign up": "Jisajili",
    "Terms and Conditions": "Masharti na Vigezo",
    "Terms of Service": "Masharti ya Huduma",
    "Too many requests. Please try again later.": "Maombi mengi sana. Tafadhali jaribu tena baadaye.",
    "Try another image": "Jaribu picha nyingine",
    "Unauthorized access. Please check your API key.": "Ufikiaji usioidhinishwa. Tafadhali angalia ufunguo wako wa API.",
    "Upload Image": "Pakia Picha",
    "You can use your email to login to your account.": "Unaweza kutumia barua pepe yako kuingia kwenye akaunti yako.",
    "We Couldn't Find Your Product": "Hatukupata bidhaa yako",
    "We might not have your product yet, try searching by name.": "Huenda hatujawahi kupata bidhaa yako, jaribu kutafuta kwa jina.",
    "Enter name of product": "Ingiza jina la bidhaa",
    "Home": "Nyumbani",
    "Profile": "Wasifu",
    "Logout": "Toka",
    "Proceed to Chatbot": "Endelea hadi Chatbot",
    "No Product History": "Hakuna Historia ya Bidhaa",
    "Scan or upload to": "Piga picha au sogeza kwenye",
    "get started": "Anza",
    "Scan or upload an image of your products'": "Piga picha au sogeza picha ya bidhaa zako",
    "to identify your product": "kutambua bidhaa yako",
    "Upload": "Pakia",
    "Scan": "Skani",
    "Guest": "Mgeni",
    "guest@example.com": "mgeni@example.com",
    "No access to camera": "Hakuna ufikiaji kwa kamera",
    "Product not found": "Bidhaa haijapatikana",
    "Try Again": "Jaribu tena",
    "Place the barcode inside the frame": "Weka barakoa kwenye fremu",
    "Capture Barcode": "Kamata barakoa",
    "Product Upload": "Kuhamisha bidhaa",
    "Barcode detected! Retrieving product details...": "Barakoa imedetectwa! Kuchukua taarifa za bidhaa...",
    "discoveredProductPrefix": "Umeanzisha",
    "discoveredProductSuffix": "! Je, unataka kujua zaidi kuhusu matumizi yake, manufaa au mapitio?",
    "Sorry, something went wrong. Please try again later.": "Samahani, kuna tatizo. Tafadhali jaribu tena baadaye.",
    "What do you want to know?": "Unataka kujua nini?",
    "Feedback": "Maoni",
    "Rate Your Experience": "Pima uzoefu wako",
    "Leave a comment": "Acha maoni",
    "Your message here": "Ujumbe wako hapa",
    "Send Feedback": "Tuma Maoni",
    "Duly Noted!": "Imezingatiwa!",
    "Thank you for your feedback! Your input helps us enhance our app to better meet your needs.": "Asante kwa maoni yako! Mchango wako unatusaidia kuboresha programu yetu ili kukidhi mahitaji yako vyema.",
    "Go Home": "Rudi Nyumbani",
    "Feedback Submitted!": "Maoni yametumwa!",
    "Thank you for your feedback!": "Asante kwa maoni yako!",
    "Error submitting feedback": "Hitilafu katika kutuma maoni",
    "Failed to submit feedback. Please try again later.": "Imeshindwa kutuma maoni. Tafadhali jaribu tena baadaye.",
    "Star": "Nyota",
    "Star-outline": "Nyota-outline",
    "Close": "Funga",
    "Accounts": "Akaunti",
    "Popular Today": "Maarufu Leo",
    "African Made": "Imetengenezwa Afrika",
    "Sponsored": "Imedhaminiwa",
    "Latest Additions": "Nyongeza za Hivi Karibuni",
    "Brand": "Chapa",
    "Shop Now": "Nunua Sasa",
    "Price": "Bei",
    "Add to Cart": "Ongeza kwenye Kikapu",
    "What is this application for?": "Maombi haya ni ya nini?",
    "Our app allows you to scan or upload a barcode to retrieve detailed information about a product. You can also proceed to our chatbot for further information and support in various languages including English, French, Swahili, Hausa, Amharic, Zulu, Twi, and Omoro.": "Programu yetu hukuruhusu kuchanganua au kupakia msimbopau",
    "How do I use the barcode scanner?": "Je, ninatumia vipi kichanganuzi cha msimbopau?",
    "To use the barcode scanner, simply tap on the Scan button, align the barcode within the viewfinder, and the app will automatically detect and retrieve the product details. Ensure your camera has sufficient lighting for accurate scanning.": "Ili kutumia kichanganuzi cha msimbo pau, gusa tu kitufe cha 'Changanua'",
    "Can I upload a barcode image instead of scanning?": "Je, ninaweza kupakia picha ya msimbopau badala ya kuchanganua?",
    "Yes, you can upload a barcode image by selecting the Upload option. Choose an image from your gallery that clearly shows the barcode. The app will process the image and provide product details similar to scanning.": "Ndiyo, unaweza kupakia picha ya msimbopau kwa kuchagua chaguo la 'Pakia'",
    "What languages does the app support?": "Je, programu inasaidia lugha gani?",
    "Our app supports multiple languages, including English, French, Swahili, Hausa, Amharic, Zulu, Twi, and Omoro. You can select your preferred language from the settings to view product information and interact with the chatbot in that language.": "Programu yetu inasaidia lugha nyingi, ikiwa ni pamoja na Kiingereza, Kifaransa, Kiswahili, Kihausa, Kiamhari, Kizulu, Kitwi, na Omoro.",
    "How can I get more information about a product?": "Ninawezaje kupata maelezo zaidi kuhusu bidhaa?",
    "After retrieving the product details, you have the option to chat with our chatbot for more in-depth information. The chatbot can assist you with additional product inquiries, availability, and other related questions.": "Baada ya kurejesha maelezo ya bidhaa, una chaguo la kuzungumza na chatbot yetu",
    "What should I do if the app does not recognize my barcode?": "Je, nifanye nini ikiwa programu haitambui msimbopau wangu?",
    "If the app does not recognize your barcode, please ensure the barcode is clear and well-lit. If you still encounter issues, try uploading a different image or contacting our support team for assistance.": "Ikiwa programu haitambui msimbopau wako, tafadhali hakikisha kuwa msimbopau uko wazi na una mwanga wa kutosha",
    "How do I contact support?": "Je, ninawezaje kuwasiliana na usaidizi?",
    "For any issues or support inquiries, you can contact us through the Help section in the app or email us directly at GETAiAfrica@gmail.com. We’re here to help you with any questions or problems you may have.": "Kwa masuala yoyote au maswali ya usaidizi, unaweza kuwasiliana nasi kupitia sehemu ya 'Msaada'",
    "Is my data safe with this app?": "Je, data yangu ni salama na programu hii?",
    "Yes, your data privacy and security are our top priorities. We use encryption and secure protocols to protect your information. For more details, please refer to our privacy policy available in the app.": "Ndiyo, faragha na usalama wa data yako ndio vipaumbele vyetu kuu",
    "1. Data Usage": "1. Matumizi ya Data",
  "We collect and use data to provide accurate product details after scanning or uploading barcodes. Your personal data will be protected in accordance with our privacy policy.": "Tunakusanya na kutumia data ili kutoa maelezo sahihi ya bidhaa baada ya kuchanganua au kupakia misimbopau. Data yako ya kibinafsi italindwa kwa mujibu wa sera yetu ya faragha",
  "2. Barcode Scanning": "2. Uchanganuzi wa msimbo pau",
  "You are responsible for ensuring that you have the legal right to scan or upload any barcode. We provide information based on available product data, but we do not guarantee its accuracy or completeness.": "Una jukumu la kuhakikisha kuwa una haki ya kisheria ya kuchanganua au kupakia msimbopau wowote. Tunatoa maelezo kulingana na data inayopatikana ya bidhaa, lakini hatuhakikishi usahihi au ukamilifu wake",
  "3. Liability Disclaimer": "3. Kanusho la Dhima",
  "We are not liable for any damages that arise from the use of incorrect or outdated product information. Please verify product details through our chatbot if necessary.": "Hatuwajibikii uharibifu wowote unaotokana na matumizi ya taarifa zisizo sahihi au zilizopitwa na wakati wa bidhaa. Tafadhali thibitisha maelezo ya bidhaa kupitia chatbot yetu ikiwa ni lazima",
  "4. Chatbot Assistance": "4. Msaada wa Chatbot",
  "The chatbot is provided to help you with additional product queries. The chatbot responses are for informational purposes only and do not constitute professional advice.": "Chatbot imetolewa ili kukusaidia na maswali ya ziada ya bidhaa. Majibu ya chatbot ni kwa madhumuni ya habari pekee na hayajumuishi ushauri wa kitaalamu",
  "5. User Responsibilities": "5. Majukumu ya Mtumiaji",
  "You must use the app in accordance with the law and refrain from submitting false or misleading data": "Ni lazima utumie programu kwa mujibu wa sheria na uepuke kuwasilisha data ya uwongo au ya kupotosha",
  "6. Changes to Terms": "6. Mabadiliko ya Masharti",
  "We reserve the right to modify these terms at any time. Please review them periodically to stay informed of updates": "Tunahifadhi haki ya kurekebisha masharti haya wakati wowote. Tafadhali zipitie mara kwa mara ili uendelee kufahamishwa kuhusu masasisho" ,
  "Welcome to our barcode scanning app. By using our services, you agree to comply with the following terms:" : "Karibu kwenye programu yetu ya kuchanganua misimbopau. Kwa kutumia huduma zetu, unakubali kutii sheria na masharti yafuatayo:"
}
