{
    "Account & Security": "Akaunti ne Dɔɔso",
    "Add your email": "Ka w'email ho",
    "Bad Request. Please check your input.": "Mmmɔdenyɛ bɔ. Mesrɛ hwɛ nsɛm a wotee mu.",
    "By continuing you accept our": "Sɛ woto so a, ɛkyerɛ sɛ w'ase nsɛm yi:",
    "Change Picture": "Sesã mfonini",
    "Create your": "Bɔ w'ankasa",
    "Dark Mode": "Tuntum Suapɔn",
    "Email": "Email",
    "Error": "Mfomso",
    "Extracting barcode...": "Redi barcode no...",
    "Full Name": "Din Foforo",
    "GetAI account": "GetAI Akaunti",
    "GetAI is an AI-powered barcode scanner": "GetAI yɛ AI a ɛbɔ barcode hwɛfoɔ",
    "Invalid barcode format.": "Barcode format no nyɛ fɛ.",
    "Languages": "Nkasafua",
    "Log in": "Hyɛ mu",
    "Network error. Please check your connection.": "Ntɔnkwahɔ mfomso. Mesrɛ hwɛ wo ntɔnkwahɔ no.",
    "Notifications": "Nkɔmmɔbea",
    "Password": "Kɔɔd no",
    "Phone Number": "Simu Nɔmba",
    "Product uploaded successfully!": "Wɔ de adwadie no ato so yiye!",
    "Rate GetAI": "Fa GetAI yɛ adehunu",
    "Save Changes": "Kyɛ nkɔsoɔ",
    "Scanned Products": "Adwadie a wɔhwɛe so",
    "Server Error": "Server Mfomso",
    "Settings": "Nhyɛɛmu",
    "Share App": "Kyɛ App no",
    "Sign up": "Bɔ mu",
    "Read Less": "Kenkan kakra",
    "Read More": "Kenkan pii",
    "Find More Details in Chatbot": "Hu nsɛm pii wɔ Chatbot mu",
    "Terms and Conditions": "Ahyɛdeɛ ne Nkwasoɔ",
    "Terms of Service": "Ahyɛdeɛ ne Nkwasoɔ",
    "Too many requests. Please try again later.": "Nsɛmbisaɛ dɔɔso. Mesrɛ sɔ hwɛ bio akyire.",
    "Try another image": "Sɔ mfonini foforo hwɛ",
    "Unauthorized access. Please check your API key.": "Ɔkwan a wɔamfa wo so no. Mesrɛ hwɛ wo API Key no.",
    "We Couldn't Find Your Product": "Yennya wo adwadie no nni hɔ",
    "We might not have your product yet, try searching by name.": "Ɛbɛyɛ sɛ yenni wo adwadie no wɔ ha sɛn, sɔ hwɛ de din bɔ mu.",
    "Enter name of product": "Fa adwadie din no kɔmu",
    "Upload Image": "Ka mfonini ho",
    "You can use your email to login to your account.": "Wobɛtumi de w'email hyɛ akaunti mu.",
    "Home": "Fie",
    "Profile": "Akauntibea",
    "Logout": "Fi mu",
    "Proceed to Chatbot": "Ko Chatbot so",
    "No Product History": "Nni adwadie ho amanneɛ",
    "Scan or upload to": "Hwɛ so anaa ka ho",
    "get started": "fa no hyɛ ase",
    "Scan or upload an image of your products'": "Hwɛ so anaa ka w'adwadie mfonini ho",
    "to identify your product": "dehu wo adwadie",
    "Upload": "Ka ho",
    "Scan": "Hwɛ so",
    "Guest": "ɔkɔtɔnyɛ",
    "guest@gmail.com": "ɔkɔtɔnyɛ@gmail.com",
    "No access to camera": "Nnsohwɛnhyɛn nka kamera",
    "Product not found": "Wɔnhu adwadie no",
    "Try Again": "Sɔ hwɛ bio",
    "Place the barcode inside the frame": "Fa barcode no hyɛ nanabenka mu",
    "Capture Barcode": "Fa Barcode no ho",
    "Barcode detected! Retrieving product details...": "Wɔahu barcode no! Wɔreyi adwadie ho nsɛm...",
    "An error occurred. Please try again.": "Mfomso bi si. Sɔ hwɛ bio.",
    "Product Upload": "Adwadie Ato Ho",
    "discoveredProductPrefix": "Woahu",
    "discoveredProductSuffix": "! Wopɛ sɛ wo nya nkyerɛmu, mfasoɔ, anaa adwadie a wɔadwen ho?",
    "Sorry, something went wrong. Please try again later.": "Mepaakyɛw, biribi nsiyei. Mesrɛ sɔ hwɛ bio akyire.",
    "What do you want to know?": "Dɛn na wopɛ sɛ wohu?",
    "Feedback": "Nsɛm kɔmu",
    "Rate Your Experience": "Toto wo nneyɛe so",
    "Leave a comment": "Gya nsɛm kɔmu",
    "Your message here": "W’adɛɛyɛ yi wɔ ha",
    "Send Feedback": "Tua nsɛm kɔmu",
    "Duly Noted!": "Wɔahyehyɛ yiye!",
    "Thank you for your feedback! Your input helps us enhance our app to better meet your needs.": "Meda wo ase sɛ woanya nsɛm kɔmu! Wo nkyerɛkyerɛ no bɛboa ma yɛnam so asiesie yɛn app no yiye sɛ ɛbɛsɔ wo ho.",
    "Go Home": "San kɔ fie",
    "Feedback Submitted!": "Wɔatumi de nsɛm kɔmu ato hɔ!",
    "Thank you for your feedback!": "Meda wo ase sɛ woanya nsɛm kɔmu!",
    "Error submitting feedback": "Mfomso wɔ nsɛm kɔmu de ato hɔ",
    "Failed to submit feedback. Please try again later.": "Wɔantumi amfa nsɛm kɔmu no. Sɛ wohwɛ bio a ɛbɛyɛ.",
    "Star": "Fawohodie",
    "Star-outline": "Fawohodie-outline",
    "Close": "To mu",
    "Popular Today": "Ede Ahorow ɛnnɛ",
    "African Made": "Wɔ Afrani",
    "Sponsored": "Nkonimdi",
    "Latest Additions": "Nkae Foforo",
    "Brand": "Din",
    "Shop Now": "Tɔ No Seisei",
    "Price": "Bɔ",
    "Add to Cart": "Ka Ho Kɔtɔ",
    "What is this application for?": "Dɛn na wɔde akwammisa krataa yi yɛ?",
    "Our app allows you to scan or upload a barcode": "Yɛn app no ​​ma wo kwan ma wo scan anaa wode barcode bi gu so",
    "How do I use the barcode scanner?": "Ɔkwan bɛn so na mede barcode scanner no di dwuma?",
    "To use the barcode scanner, simply tap on the 'Scan' button": "Sɛ wopɛ sɛ wode barcode scanner no di dwuma a, pia ‘Scan’ button no so kɛkɛ",
    "Can I upload a barcode image instead of scanning?": "So metumi de barcode mfonini bi ahyɛ so sen sɛ mɛyɛ scan?",
    "Yes, you can upload a barcode image by selecting the 'Upload' option": "Yiw, wubetumi de barcode mfonini bi akɔ so denam ‘Upload’ a wobɛpaw no so",
    "What languages does the app support?": "Kasa bɛn na app no ​​boa?",
    "Our app supports multiple languages, including English, French, Swahili, Hausa, Amharic, Zulu, Twi, and Omoro": "Yɛn app no ​​boa kasa ahorow pii, a Borɔfo, Franse, Swahili, Hausa, Amharic, Zulu, Twi, ne Omoro ka ho",
    "How can I get more information about a product?": "Mɛyɛ dɛn atumi anya ade bi ho nsɛm pii?",
    "After retrieving the product details, you have the option to chat with our chatbot": "Sɛ wogye afiri no ho nsɛm wie a, wowɔ hokwan sɛ wo ne yɛn chatbot no bɛbɔ nkɔmmɔ",
    "What should I do if the app does not recognize my barcode?": "Sɛ app no ​​nhu me barcode no a, dɛn na ɛsɛ sɛ meyɛ?",
    "If the app does not recognize your barcode, please ensure the barcode is clear and well-lit": "Sɛ app no ​​nhu wo barcode no a, yɛsrɛ wo hwɛ hu sɛ barcode no mu da hɔ na hann a ɛwɔ mu yiye",
    "How do I contact support?": "Ɔkwan bɛn so na metumi ne mmoa adi nkitaho?",
    "For any issues or support inquiries, you can contact us through the 'Help' section": "Sɛ wopɛ nsɛm anaa mmoa ho nsɛm biara a, wobɛtumi afa ‘Mmoa’ ɔfa no so ne yɛn adi nkitaho",
    "Is my data safe with this app?": "So me data yɛ ahobammɔ wɔ saa app yi so?",
    "Yes, your data privacy and security are our top priorities": "Yiw, wo data kokoamsɛm ne ahobammɔ ne nneɛma atitiriw a yɛde di kan" ,
    "1. Data Usage": "1. Data a Wɔde Di Dwuma",
  "We collect and use data to provide accurate product details after scanning or uploading barcodes. Your personal data will be protected in accordance with our privacy policy.": "Yɛboaboa data ano na yɛde di dwuma de ma nneɛma no ho nsɛm a ɛyɛ nokware bere a yɛayɛ scan anaa yɛde barcode ahorow akɔ so awie no. Wɔbɛbɔ wo ho nsɛm ho ban sɛnea yɛn kokoam nsɛm ho nhyehyɛe kyerɛ no",
  "2. Barcode Scanning": "2. Barcode a wɔde hwehwɛ nneɛma mu",
  "You are responsible for ensuring that you have the legal right to scan or upload any barcode. We provide information based on available product data, but we do not guarantee its accuracy or completeness.": "Ɛyɛ w’asɛdeɛ sɛ wobɛhwɛ sɛ wowɔ mmara kwan so hokwan sɛ wo scan anaa wode barcode biara gu so. Yɛde nsɛm a egyina nneɛma ho nsɛm a ɛwɔ hɔ so ma, nanso yɛnhyɛ bɔ sɛ ɛyɛ nokware anaasɛ edi mũ",
  "3. Liability Disclaimer": "3. Asɛyɛde Ho Nsɛm a Wɔka",
  "We are not liable for any damages that arise from the use of incorrect or outdated product information. Please verify product details through our chatbot if necessary.": "Yɛnnyɛ asodi biara wɔ nneɛma biara a ɛsɛe a efi nneɛma ho nsɛm a ɛnteɛ anaasɛ ne bere atwam a yɛde di dwuma no ho. Yɛsrɛ sɛ sɛ ɛho hia a, fa yɛn chatbot no so hwɛ nneɛma ho nsɛm a ɛyɛ nokware",
  "4. Chatbot Assistance": "4. Chatbot Mmoa a Wɔde Ma",
  "The chatbot is provided to help you with additional product queries. The chatbot responses are for informational purposes only and do not constitute professional advice.": "Wɔde chatbot no ama sɛ ɛbɛboa wo wɔ nneɛma foforo ho nsɛmmisa ho. Chatbot mmuae no yɛ nsɛm nkutoo na ɛnyɛ adwumayɛfo afotu",
  "5. User Responsibilities": "5. Asɛyɛde a Wɔde Di Dwuma",
  "You must use the app in accordance with the law and refrain from submitting false or misleading data": "Ɛsɛ sɛ wode app no ​​di dwuma sɛnea mmara kyerɛ na wokwati sɛ wode data a ɛnyɛ nokware anaa ɛyɛ atoro bɛmena",
  "6. Changes to Terms": "6. Nsakrae a wɔyɛ wɔ Nsɛm a Wɔde Di Dwuma Mu",
  "We reserve the right to modify these terms at any time. Please review them periodically to stay informed of updates": "Yɛwɔ hokwan sɛ yɛsesa saa nhyehyɛe yi bere biara. Yɛsrɛ sɛ hwɛ wɔn mu bere ne bere mu na ama woahu nsɛm foforo",
  "Welcome to our barcode scanning app. By using our services, you agree to comply with the following terms:": "Yɛma wo akwaaba ba yɛn barcode scanning app no ​​mu. Sɛ wode yɛn nnwuma no di dwuma a, ɛkyerɛ sɛ woapene so sɛ wubedi nsɛm a edidi so yi so:"
}
