{
    "Account & Security": "I-akhawunti Nezokuphepha",
    "Add your email": "Faka i-imeyili yakho",
    "Bad Request. Please check your input.": "Isicelo Esibi. Sicela uhlole okutholakele kwakho.",
    "By continuing you accept our": "Ngokuqhubeka uyavuma",
    "Change Picture": "Shintsha Isithombe",
    "Create your": "Dala eyakho",
    "Dark Mode": "Imodi Emnyama",
    "Email": "I-imeyili",
    "Error": "Iphutha",
    "Extracting barcode...": "Kukhishwa ikhodi ye-bar...",
    "Full Name": "Igama eligcwele",
    "GetAI account": "I-akhawunti ye-GetAI",
    "GetAI is an AI-powered barcode scanner": "I-GetAI iyiskani yekhodi ye-bar eqhutshwa yi-AI",
    "Invalid barcode format.": "Ifomethi yekhodi ye-bar ayivumelekile.",
    "Languages": "Izilimi",
    "Log in": "Ngena",
    "Network error. Please check your connection.": "Iphutha lenethiwekhi. Sicela uhlole ukuxhumeka kwakho.",
    "Notifications": "Izaziso",
    "Password": "Iphasiwedi",
    "Phone Number": "Inombolo Yocingo",
    "Product uploaded successfully!": "Umkhiqizo ulayishwe ngempumelelo!",
    "Rate GetAI": "Linganisela i-GetAI",
    "Save Changes": "Londoloza Izinguquko",
    "Scanned Products": "Imikhiqizo Escanwe",
    "Server Error": "Iphutha Lesiphakeli",
    "Settings": "Izilungiselelo",
    "Share App": "Yabelana Ngohlelo Lokusebenza",
    "Sign up": "Bhalisa",
    "Read Less": "Funda Okuncane",
    "Read More": "Funda Okuningi",
    "Find More Details in Chatbot": "Thola Imininingwane Eyengeziwe Ku-Chatbot",
    "Terms and Conditions": "Imigomo Nemibandela",
    "Terms of Service": "Imigomo Yesevisi",
    "Too many requests. Please try again later.": "Izicelo eziningi kakhulu. Sicela uzame futhi kamuva.",
    "Try another image": "Zama esinye isithombe",
    "Unauthorized access. Please check your API key.": "Ukufinyelela okungagunyaziwe. Sicela uhlole ukhiye wakho we-API.",
    "We Couldn't Find Your Product": "Asikwazanga ukuthola Umkhiqizo Wakho",
    "We might not have your product yet, try searching by name.": "Singase singabi nawo umkhiqizo wakho okwamanje, zama ukufuna ngegama.",
    "Enter name of product": "Faka igama lomkhiqizo",
    "Upload Image": "Layisha Isithombe",
    "You can use your email to login to your account.": "Ungasebenzisa i-imeyili yakho ukuze ungene ku-akhawunti yakho.",
    "Home": "Ikhaya",
    "Profile": "Iphrofayela",
    "Logout": "Phuma",
    "Proceed to Chatbot": "Qhubeka Ku-Chatbot",
    "No Product History": "Awekho Umlando Womkhiqizo",
    "Scan or upload to": "Skena noma ulayishe ukuze",
    "get started": "uqale",
    "Scan or upload an image of your products'": "Skena noma ulayishe isithombe semikhiqizo yakho",
    "to identify your product": "ukuze uthole umkhiqizo wakho",
    "Upload": "Layisha",
    "Scan": "Skena",
    "Guest": "Isivakashi",
    "guest@gmail.com": "guest@gmail.com",
    "No access to camera": "Ayikho imvume yokusebenzisa ikhamera",
    "Product not found": "Umkhiqizo awutholakalanga",
    "Try Again": "Zama Futhi",
    "Place the barcode inside the frame": "Beka ikhodi ye-bar ngaphakathi kufreyimu",
    "Capture Barcode": "Thwebula Ikhodi ye-Bar",
    "Barcode detected! Retrieving product details...": "Ikhodi ye-bar itholiwe! Kulandwa imininingwane yomkhiqizo...",
    "An error occurred. Please try again.": "Kube nephutha. Sicela uzame futhi.",
    "Product Upload": "Ukulayisha Umkhiqizo",
    "discoveredProductPrefix": "Uthole",
    "discoveredProductSuffix": "! Ingabe ungathanda ukwazi kabanzi ngokusetshenziswa kwayo, izinzuzo, noma ukubuyekeza?",
    "Sorry, something went wrong. Please try again later.": "Uxolo, kukhona okungahambi kahle. Sicela uzame futhi kamuva.",
    "What do you want to know?": "Ufuna ukwazi ini?",
    "Feedback": "Impendulo",
    "Rate Your Experience": "Linganisela Okuhlangenwe Nakho Kwakho",
    "Leave a comment": "Shiya amazwana",
    "Your message here": "Umlayezo wakho lapha",
    "Send Feedback": "Thumela Impendulo",
    "Duly Noted!": "Kubhalwe phansi kahle!",
    "Thank you for your feedback! Your input helps us enhance our app to better meet your needs.": "Siyabonga ngempendulo yakho! Umnikelo wakho usisiza ukuthuthukisa uhlelo lwethu ukuze sihlangabezane nezidingo zakho kahle.",
    "Go Home": "Buyela Ekhaya",
    "Feedback Submitted!": "Impendulo ithunyelwe!",
    "Thank you for your feedback!": "Siyabonga ngempendulo yakho!",
    "Error submitting feedback": "Iphutha ekuthumeleni impendulo",
    "Failed to submit feedback. Please try again later.": "Yehlulekile ukuthumela impendulo. Sicela uzame futhi kamuva.",
    "Star": "Inkwenkwezi",
    "Star-outline": "Inkwenkwezi-outline",
    "Close": "Vala",
    "Popular Today": "Kudumile Namuhla",
    "African Made": "Kwenziwe e-Afrika",
    "Sponsored": "Ixhaswe",
    "Latest Additions": "Izithasiselo Zakamuva",
    "Brand": "Umkhiqizo",
    "Shop Now": "Thenga Manje",
    "Price": "Intengo",
    "Add to Cart": "Engeza Ekhephini",
    "What is this application for?": "Lesi sicelo senzelweni?",
    "Our app allows you to scan or upload a barcode": "Uhlelo lwethu lokusebenza likuvumela ukuthi uskene noma ulayishe ibhakhodi",
    "How do I use the barcode scanner?": "Ngisisebenzisa kanjani isithwebuli sebhakhodi?",
    "To use the barcode scanner, simply tap on the 'Scan' button": "Ukuze usebenzise isithwebuli sebhakhodi, mane uchofoze inkinobho ethi 'Skena'",
    "Can I upload a barcode image instead of scanning?": "Ngingakwazi ukulayisha isithombe sebhakhodi esikhundleni sokuskena?",
    "Yes, you can upload a barcode image by selecting the 'Upload' option": "Yebo, ungalayisha isithombe sebhakhodi ngokukhetha inketho ethi 'Layisha'",
    "What languages does the app support?": "Iziphi izilimi ezisekelwa uhlelo lokusebenza?",
    "Our app supports multiple languages, including English, French, Swahili, Hausa, Amharic, Zulu, Twi, and Omoro": "Uhlelo lwethu lokusebenza lusekela izilimi eziningi, okuhlanganisa isiNgisi, isiFulentshi, isiSwahili, isiHausa, isi-Amharic, isiZulu, isiTwi, nesi-Omoro",
    "How can I get more information about a product?": "Ngingaluthola kanjani ulwazi olwengeziwe mayelana nomkhiqizo?",
    "After retrieving the product details, you have the option to chat with our chatbot": "Ngemva kokubuyisa imininingwane yomkhiqizo, unenketho yokuxoxa ne-chatbot yethu",
    "What should I do if the app does not recognize my barcode?": "Yini okufanele ngiyenze uma uhlelo lokusebenza lungayazi ibhakhodi yami?",
    "If the app does not recognize your barcode, please ensure the barcode is clear and well-lit": "Uma uhlelo lokusebenza lungayazi ibhakhodi yakho, sicela uqinisekise ukuthi ibhakhodi icacile futhi ikhanya kahle",
    "How do I contact support?": "Ngixhumana kanjani nabosekelo?",
    "For any issues or support inquiries, you can contact us through the 'Help' section": "Nganoma yiziphi izinkinga noma imibuzo yosekelo, ungasithinta ngesigaba 'sosizo'",
    "Is my data safe with this app?": "Ingabe idatha yami iphephile ngalolu hlelo lokusebenza?",
    "Yes, your data privacy and security are our top priorities": "Yebo, ubumfihlo bedatha yakho nokuvikeleka yizinto eziza kuqala kithi" ,
    "1. Data Usage": "1. Ukusetshenziswa kwedatha",
  "We collect and use data to provide accurate product details after scanning or uploading barcodes. Your personal data will be protected in accordance with our privacy policy.": "Siqoqa futhi sisebenzisa idatha ukuze sinikeze imininingwane enembile yomkhiqizo ngemva kokuskena noma ukulayisha amabhakhodi. Idatha yakho yomuntu siqu izovikelwa ngokuvumelana nenqubomgomo yethu yobumfihlo",
  "2. Barcode Scanning": "2. Ukuskena ibhakhodi",
  "You are responsible for ensuring that you have the legal right to scan or upload any barcode. We provide information based on available product data, but we do not guarantee its accuracy or completeness.": "Unesibopho sokuqinisekisa ukuthi unelungelo elingokomthetho lokuskena noma ukulayisha noma iyiphi ibhakhodi. Sihlinzeka ngolwazi olusekelwe kudatha yomkhiqizo etholakalayo, kodwa asiqinisekisi ukunemba noma ukuphelela kwayo",
  "3. Liability Disclaimer": "3. Umshwana Wokuzikhipha Emthwalweni Wesikweletu",
  "We are not liable for any damages that arise from the use of incorrect or outdated product information. Please verify product details through our chatbot if necessary.": "Asinasibopho sanoma yimuphi umonakalo ovela ngenxa yokusebenzisa ulwazi lomkhiqizo olungalungile noma oluphelelwe yisikhathi. Sicela uqinisekise imininingwane yomkhiqizo nge-chatbot yethu uma kunesidingo",
  "4. Chatbot Assistance": "4. Usizo lwe-Chatbot",
  "The chatbot is provided to help you with additional product queries. The chatbot responses are for informational purposes only and do not constitute professional advice.": "I-chatbot ihlinzekwa ukukusiza ngemibuzo eyengeziwe yomkhiqizo. Izimpendulo ze-chatbot ezezinjongo zokwaziswa kuphela futhi azihlanganisi iseluleko sochwepheshe",
  "5. User Responsibilities": "5. Izibopho Zomsebenzisi",
  "You must use the app in accordance with the law and refrain from submitting false or misleading data": "Kufanele usebenzise uhlelo lokusebenza ngokuhambisana nomthetho futhi uyeke ukuhambisa idatha engamanga noma edukisayo",
  "6. Changes to Terms": "6. Izinguquko Zemibandela",
  "We reserve the right to modify these terms at any time. Please review them periodically to stay informed of updates": "Sigodla ilungelo lokuguqula le migomo noma kunini. Sicela uzibuyekeze ngezikhathi ezithile ukuze uhlale unolwazi ngezibuyekezo",
  "Welcome to our barcode scanning app. By using our services, you agree to comply with the following terms:": "Siyakwamukela kuhlelo lwethu lokusebenza lokuskena ibhakhodi. Ngokusebenzisa amasevisi ethu, uyavuma ukuthobela imigomo elandelayo:"
}
